// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");



// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]
/*
Console.Clear();

Console.Write("Введите 1 элемент: ");
int num1 = int.Parse(Console.ReadLine()!);
Console.Write("Введите 2 элемент: ");
int num2 = int.Parse(Console.ReadLine()!);
Console.Write("Введите 3 элемент: ");
int num3 = int.Parse(Console.ReadLine()!);
Console.Write("Введите 4 элемент: ");
int num4 = int.Parse(Console.ReadLine()!);
Console.Write("Введите 5 элемент: ");
int num5 = int.Parse(Console.ReadLine()!);
Console.Write("Введите 6 элемент: ");
int num6 = int.Parse(Console.ReadLine()!);
Console.Write("Введите 7 элемент: ");
int num7 = int.Parse(Console.ReadLine()!);
Console.Write("Введите 8 элемент: ");
int num8 = int.Parse(Console.ReadLine()!);

Console.Write($"{num1},{num2},{num3},{num4},{num5},{num6},{num7},{num8}");
Console.WriteLine("");
*/
