//Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным 
//                                                  (делится ли оно на два без остатка).
//4 -> да
//-3 -> нет
//7 -> нет
/*
Console.Write("Введите число: "); //в терминале напишет то что ("........:  ");
int numberA = int.Parse(Console.ReadLine()!); // работаем с цифрами
// % знак для деления без остатка
if(numberA % 2 == 0) //делится ли оно на два без остатка
{
    Console.Write("Является чётным: ");
    Console.WriteLine(numberA);
}
else
{
    Console.Write("НЕ является чётным: ");
    Console.WriteLine(numberA);
}
*/
