// 4 Лекция (столбцы и строки )
Console.Clear();
/*
string[,] table = new string[2, 5];
// String.Empty
// table[0,0]  table[0,1]  table[0,2]  table[0,4] //Образец как считает
// table[1,0]  table[1,1]  table[1,2]  table[1,4] //Образец как считает

table[1,2] ="слово"; 
// line -это индекс строуи
for(int line = 0; line < 2; line++) //line - строка.Прогоняем строки 
{
    for(int columns = 0; columns < 5; columns++) // Column- столбец. Прогоняем сталбцы
    {
        Console.WriteLine($"-{table[line, columns]}-");//
    }
}

/*Ответ: 
Шаблон "Консольное приложение" успешно создан.
--
--
--
--
--
--
--
-слово-
--
--
*/

// Второе решение 
/*
int[,] matrix = new int[3,4];

for(int i = 0; i < matrix.GetLength(0); i++)//(int line = 0; line < 3; line++)
{                                          //(int i = 0; i < 3 ; i++)
    for(int j = 0; j < matrix.GetLength(1); j++)//(int columns = 0; columns < 4; columns++)
    {                                          // (int j = 0; j < 4; j++)
        Console.Write($"{matrix[i, j]} ");
    }
Console.WriteLine();
}
*/
/*
Ответ:
0 0 0 0
0 0 0 0
0 0 0 0
*/

// Третье решение с использованием воид метода

//int[,] matrix = new int[3,4]; // можно тут оставить можно в нис перенести 
/*
void PrintArray(int [,] matr)//даём сакрашенное название масива
{

    for(int i = 0; i < matr.GetLength(0); i++)//(int line = 0; line < 3; line++)
    {                                          //(int i = 0; i < 3 ; i++)
        for(int j = 0; j < matr.GetLength(1); j++)//(int columns = 0; columns < 4; columns++)
        {                                          // (int j = 0; j < 4; j++)
            Console.Write($"{matr[i, j]} ");
        }
    Console.WriteLine();
    }
}

void FillArray(int[,] matr)
{
    for(int i = 0; i < matr.GetLength(0); i++)
    {
        for( int j = 0; j < matr.GetLength(1); j++)
        {
            matr[i,j] = new Random().Next(1,10);// задаем интерва 1 -10 
        }
    }
}

int[,] matrix = new int[3,4];
PrintArray(matrix);// выводит 0 нолики 
FillArray(matrix); // заполняет этот массив случайными числами 
Console.WriteLine();// пустая строка 
PrintArray(matrix); //выводит массив случайных чисел на экран
*/
/*Ответ:
0 0 0 0
0 0 0 0
0 0 0 0

2 1 5 7 
2 5 2 3 
8 2 7 3 */

// Закрашиваем рисунок
/*
int [,] pic = new int[,]
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
    {0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0},
    {0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
};


void PrintImage(int[,] image)//даём сакрашенное название масива
{

    for(int i = 0; i < image.GetLength(0); i++)//(int line = 0; line < 3; line++)
    {                                          //(int i = 0; i < 3 ; i++)
        for(int j = 0; j < image.GetLength(1); j++)//(int columns = 0; columns < 4; columns++)
        {                                          // (int j = 0; j < 4; j++)
            if(image[i,j] == 0) Console.Write($" ");
            else Console.Write($"+");
        }
    Console.WriteLine();
    }
}
*/
//PrintImage(pic);// выводит 0 нолики 
/*Ответ:
            ++
           +  +
           +  +
          +   +
          +   +
         +   +
       ++    +
    +++     +
    +      ++++++++++    
    +                +
    +            +++++
    +                +
    +                +
    +            +++++
    +++++            +
         ++++       +
             +++++++
             */

// дополняем залвку к формуле
/*
void FillImage(int row, int col)
{
    if(pic[row, col] == 0) 
    {
        pic[row, col] = 1;
        FillImage(row -1, col);
        FillImage(row, col - 1);
        FillImage(row +1, col);
        FillImage(row, col + 1);
    }
}

PrintImage(pic);
FillImage(13, 13);
PrintImage(pic);
*/
/*Ответ:
            ++
           ++++
           ++++
          +++++
          +++++
         +++++
       +++++++
    +++++++++
    +++++++++++++++++    
    ++++++++++++++++++
    ++++++++++++++++++
    +++++++++++++++++
    ++++++++++++++++++
    ++++++++++++++++++
    ++++++++++++++++++
    ++++++++++++++++++
    ++++++++++++++++++
    ++++++++++++++++++
         ++++++++++++
             +++++++
    */




